In [ ]:
============EDA-packages===============
1)pandas: data frame applications

2)Numpy: Numerical python All math applications

3)Matplotlib: used for plotting

4)seaborn: used for plotting

5)plotly: used for plotting

6)Bokhe : used for plotting

============Machine laearning-packages=============

7) Sickit-learn: Sklearn

============Deep Learning-packages============

8) tensorflow: developed by google

9) Keras: developed by google

10) pytorch: developed by facebook

=============NLP(natural language process)-packages=========

11)NLTK: nartural language tool kit

12) scipy

===============BERT-packages===================

13)Transformers: hugging face (Google)

=============Google models==================

14) specific google packages

============Azure ML====================

15)Azure packages

===========GenAI====================

16) Gemini: Google

17) ChatGpt: openAI

=====================LangChain================

18)Langchain packages

In [1]:
a=10
b=20
c=a+b
c

30

**Create a dataframe using list**

$step-1$

#create empty dataframe

In [3]:
import pandas as pd
names=['Ayush','Avinash','Akash']
pd.DataFrame()#empty dataframe no rows and no columns

Empty DataFrame
Columns: []
Index: []

In [5]:
names=['Ayush','Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [10]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
pd.DataFrame(zip(names,age))
#what is the first positional arugument: data
#second postional arguemnt: index

         0   1
0    Ayush  20
1  Avinash  30
2    Akash  40

In [11]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
address=['hyd','mum','del']
pd.DataFrame(zip(names,age,address))

         0   1    2
0    Ayush  20  hyd
1  Avinash  30  mum
2    Akash  40  del

In [19]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
address=['hyd','mum','del']
data=zip(names,age)
pd.DataFrame(data,address)

           0   1
hyd    Ayush  20
mum  Avinash  30
del    Akash  40

In [1]:
import pandas as pd
names=['Ayush','Avinash','Akash']
age=[20,30,40]
address=['hyd','mum','del']
pd.DataFrame(zip(names,age,address),columns=['names','Age','address'])

     names  Age address
0    Ayush   20     hyd
1  Avinash   30     mum
2    Akash   40     del

$step-3$

**provide the column names**

In [21]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
address=['hyd','mum','del']
data=zip(names,age,address)
cols=['Names','Age','Address']
pd.DataFrame(data,columns=cols)

     Names  Age Address
0    Ayush   20     hyd
1  Avinash   30     mum
2    Akash   40     del

In [22]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
address=['hyd','mum','del']
data=zip(names,age,address)
cols=['Names','Age','Address']
df=pd.DataFrame(data,columns=cols)

In [23]:
type(df)

pandas.core.frame.DataFrame

$step-4$

**Add new column**

- If you want to add new column
- first you need to check the numbers of rowns in already existed data
- for example in above the dataframe has 3 rows
- you need to create a new list 3 rows
- That list quate to the dataframe

In [24]:
#creating new column in the dataframe
job=['DS','DE','CS']
df['JOB']=job
df

     Names  Age Address JOB
0    Ayush   20     hyd  DS
1  Avinash   30     mum  DE
2    Akash   40     del  CS

In [27]:
#step-5
#update the already existing column
df['Age']=[35,40,33]
df

     Names  Age Address JOB
0    Ayush   35     hyd  DS
1  Avinash   40     mum  DE
2    Akash   33     del  CS

$step-6$

**Change the index**

In [34]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
address=['hyd','mum','del']
data=zip(names,age,address)
cols=['Names','Age','Address']
ix=['a','b','c']
df=pd.DataFrame(data,index=ix,columns=cols)
df

     Names  Age Address
a    Ayush   20     hyd
b  Avinash   30     mum
c    Akash   40     del

**Note**
- number of list=number of columns
- number of values inside list=number of rows
- when you create the data all the list will be in the same length

$step-7$

**shape**

- Number of rows

- Number of columns

In [32]:
df.shape
#matrix format
#3 rows and 3 columns
print("The number of rows are:" , df.shape[0])
print("The number of colmuns are:" , df.shape[1])

The number of rows are: 3
The number of colmuns are: 3

$step-8$

**Drop the column**

- In order to drop column we required 3 arguments
- Column name
    - The column name we need to mention

- axis
    - axis=0 **repressents rows**
    - axis=1 **represents columns**

- Inplace
    - We are droping the column means we are modifying the data frame
    - so this modifications we want to save in same varibale or different variavble
    - if you want to keep in the same variable the **inplace=true**

In [35]:
df.drop('Address',axis=1,inplace=True)
df

     Names  Age
a    Ayush   20
b  Avinash   30
c    Akash   40

In [39]:
updated_df=df.drop('Age',axis=1)
df
#here inplavce= false by default it won't do any chnages in the variable

     Names  Age
a    Ayush   20
b  Avinash   30
c    Akash   40

In [38]:
updated_df

     Names
a    Ayush
b  Avinash
c    Akash

In [40]:
updated_df_2=df.drop('c',axis=0)
updated_df_2

     Names  Age
a    Ayush   20
b  Avinash   30

$step-9$

#drop multiple columns

In [45]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
address=['hyd','mum','del']
data=zip(names,age,address)
cols=['Names','Age','Address']
ix=['a','b','c']
df=pd.DataFrame(data,index=ix,columns=cols)
df.drop(['Age','Address'],axis=1,inplace=True)
df

     Names
a    Ayush
b  Avinash
c    Akash

$step-11$

**How to save the dataframe**

- Generally data frames are two types
- csv(comma sepearted value)
- excel

In [50]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
address=['hyd','mum','del']
data=zip(names,age,address)
cols=['Names','Age','Address']
ix=['a','b','c']
df=pd.DataFrame(data,index=ix,columns=cols)
#file name=data
#extension =.csv
#below will remove the indexes
df.to_csv('data1.csv',index=False)

In [2]:
names=['Ayush','Avinash','Akash']
age=[20,30,40]
address=['hyd','mum','del']
data=zip(names,age,address)
cols=['Names','Age','Address']
ix=['a','b','c']
df=pd.DataFrame(data,index=ix,columns=cols)
#file name=data
#extension =.csv
#below will remove the indexes
df.to_excel('data1.xlsx',index=False)

In [6]:
from PIL import Image

In [8]:
dir(Image)

['ADAPTIVE',
 'AFFINE',
 'BICUBIC',
 'BILINEAR',
 'BOX',
 'Callable',
 'DECODERS',
 'DEFAULT_STRATEGY',
 'DecompressionBombError',
 'DecompressionBombWarning',
 'DeferredError',
 'Dither',
 'ENCODERS',
 'EXTENSION',
 'EXTENT',
 'ElementTree',
 'Exif',
 'ExifTags',
 'FASTOCTREE',
 'FILTERED',
 'FIXED',
 'FLIP_LEFT_RIGHT',
 'FLIP_TOP_BOTTOM',
 'FLOYDSTEINBERG',
 'HAMMING',
 'HUFFMAN_ONLY',
 'ID',
 'Image',
 'ImageMode',
 'ImagePointHandler',
 'ImageTransformHandler',
 'IntEnum',
 'LANCZOS',
 'LIBIMAGEQUANT',
 'MAXCOVERAGE',
 'MAX_IMAGE_PIXELS',
 'MEDIANCUT',
 'MESH',
 'MIME',
 'MODES',
 'MutableMapping',
 'NEAREST',
 'NONE',
 'OPEN',
 'ORDERED',
 'PERSPECTIVE',
 'Palette',
 'Path',
 'QUAD',
 'Quantize',
 'RASTERIZE',
 'RLE',
 'ROTATE_180',
 'ROTATE_270',
 'ROTATE_90',
 'Resampling',
 'SAVE',
 'SAVE_ALL',
 'TRANSPOSE',
 'TRANSVERSE',
 'TiffTags',
 'Transform',
 'Transpose',
 'USE_CFFI_ACCESS',
 'UnidentifiedImageError',
 'WEB',
 '_E',
 '_ENDIAN',
 '_MAPMODES',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 '__version__',
 '_apply_env_variables',
 '_check_size',
 '_conv_type_shape',
 '_decompression_bomb_check',
 '_filters_support',
 '_fromarray_typemap',
 '_getdecoder',
 '_getencoder',
 '_getscaleoffset',
 '_initialized',
 '_plugins',
 '_show',
 '_wedge',
 'alpha_composite',
 'annotations',
 'atexit',
 'blend',
 'builtins',
 'cffi',
 'composite',
 'core',
 'effect_mandelbrot',
 'effect_noise',
 'enum',
 'eval',
 'fromarray',
 'frombuffer',
 'frombytes',
 'fromqimage',
 'fromqpixmap',
 'getmodebandnames',
 'getmodebands',
 'getmodebase',
 'getmodetype',
 'i32le',
 'init',
 'io',
 'isImageType',
 'is_path',
 'item',
 'linear_gradient',
 'logger',
 'logging',
 'math',
 'merge',
 'module',
 'new',
 'o32be',
 'o32le',
 'open',
 'os',
 'preinit',
 'radial_gradient',
 're',
 'register_decoder',
 'register_encoder',
 'register_extension',
 'register_extensions',
 'register_mime',
 'register_open',
 'register_save',
 'register_save_all',
 'registered_extensions',
 'struct',
 'sys',
 'tempfile',
 'warnings']